sysbench/yusp/master/single_range.log
sysbench 1.0.9 (using system LuaJIT 2.0.4)

Running the test with following options:
Number of threads: 512
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 512 tps: 3035.13 qps: 18341.92 (r/w/o: 12224.68/0.00/6117.24) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 512 tps: 3061.71 qps: 18376.46 (r/w/o: 12253.94/0.00/6122.52) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 512 tps: 3068.60 qps: 18386.60 (r/w/o: 12249.20/0.00/6137.40) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 512 tps: 3058.75 qps: 18370.52 (r/w/o: 12254.41/0.00/6116.11) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 512 tps: 3066.18 qps: 18384.36 (r/w/o: 12251.91/0.00/6132.45) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 512 tps: 3059.59 qps: 18366.73 (r/w/o: 12250.85/0.00/6115.88) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 512 tps: 3065.80 qps: 18387.99 (r/w/o: 12251.69/0.00/6136.30) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 512 tps: 3057.40 qps: 18365.18 (r/w/o: 12248.98/0.00/6116.19) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 512 tps: 3066.54 qps: 18386.05 (r/w/o: 12254.37/0.00/6131.68) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 512 tps: 3063.83 qps: 18384.40 (r/w/o: 12258.03/0.00/6126.37) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 512 tps: 3060.37 qps: 18363.42 (r/w/o: 12242.38/0.00/6121.04) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 512 tps: 3062.79 qps: 18383.22 (r/w/o: 12255.15/0.00/6128.07) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 512 tps: 3062.10 qps: 18371.02 (r/w/o: 12246.61/0.00/6124.41) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 512 tps: 3060.87 qps: 18377.00 (r/w/o: 12256.27/0.00/6120.73) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 512 tps: 3068.00 qps: 18383.61 (r/w/o: 12249.60/0.00/6134.00) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 512 tps: 3062.80 qps: 18379.39 (r/w/o: 12253.29/0.00/6126.10) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 512 tps: 3060.90 qps: 18372.90 (r/w/o: 12253.00/0.00/6119.90) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 512 tps: 3065.30 qps: 18376.23 (r/w/o: 12244.92/0.00/6131.31) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 512 tps: 3059.50 qps: 18370.49 (r/w/o: 12251.79/0.00/6118.70) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 512 tps: 3064.22 qps: 18380.30 (r/w/o: 12253.16/0.00/6127.13) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 512 tps: 3061.88 qps: 18375.09 (r/w/o: 12248.83/0.00/6126.26) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 512 tps: 3061.98 qps: 18389.48 (r/w/o: 12264.52/0.00/6124.96) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 512 tps: 3065.31 qps: 18374.09 (r/w/o: 12244.36/0.00/6129.73) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 512 tps: 3063.82 qps: 18368.62 (r/w/o: 12241.08/0.00/6127.54) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 512 tps: 3060.29 qps: 18381.32 (r/w/o: 12258.95/0.00/6122.37) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 512 tps: 3062.60 qps: 18372.39 (r/w/o: 12250.49/0.00/6121.90) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 512 tps: 3064.30 qps: 18376.49 (r/w/o: 12247.40/0.00/6129.10) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 512 tps: 3057.60 qps: 18370.33 (r/w/o: 12250.72/0.00/6119.61) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 512 tps: 3064.79 qps: 18375.06 (r/w/o: 12249.67/0.00/6125.39) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 512 tps: 3064.48 qps: 18382.60 (r/w/o: 12249.93/0.00/6132.67) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3676392
        write:                           0
        other:                           1838196
        total:                           5514588
    transactions:                        919098 (3062.55 per sec.)
    queries:                             5514588 (18375.32 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.1067s
    total number of events:              919098

Latency (ms):
         min:                                 75.92
         avg:                                167.15
         max:                                299.27
         95th percentile:                    196.89
         sum:                            153629744.73

Threads fairness:
    events (avg/stddev):           1795.1133/185.53
    execution time (avg/stddev):   300.0581/0.03